teaching.html
---
layout: page
title: Teaching
---
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Fall 2014: CDS 270 &#x2014; Networked Control Systems</h2>
<div class="outline-text-2" id="text-1">
<hr  />
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Course Description</h2>
<div class="outline-text-2" id="text-2">
<p>
Networked control systems are spatially distributed systems for which the communication between sensors, actuators and controllers is supported by communication networks. Recent advances in sensing, communication technologies and computer architecture have led to the rapid growth of cost effective and low power devices, which dramatically increases the adaptability, efficiency and functionality of the control systems. However, networked control systems also introduce new challenges, as the information becomes local to each node and the information sharing between nodes may subject to network effects such as packet drop or delay.
</p>

<p>
In this course, we will review several recent advancements in networked control theory.  We first consider a centralized control scheme, where the communication between the sensor, the controller and the actuator is unreliable. We then move to distributed control schemes and analyze the consensus algorithm, as it is key for many distributed control applications. Next, we study the performance of a consensus-based distributed inference algorithm. Finally, we discuss the consensus algorithm in adversarial environment.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Pre-requisites</h2>
<div class="outline-text-2" id="text-3">
<p>
Undergraduate linear algebra, probability and signal processing, understanding of modern (state space) control theory
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Handouts and Reference Materials</h2>
<div class="outline-text-2" id="text-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">Course</th>
<th scope="col" class="left">Topic</th>
<th scope="col" class="left">Reading</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1</td>
<td class="left">Course Overview</td>
<td class="left"><a href="http://www.cds.caltech.edu/~murray/cdspanel/report/cdspanel-15aug02.pdf">Control in an Information Rich World</a>, <a href="../../public/cds270/lecture01.pdf">Notes</a></td>
</tr>

<tr>
<td class="right">2</td>
<td class="left">State Estimation, Kalman Filtering</td>
<td class="left"><a href="http://www.cs.unc.edu/~welch/kalman/">Kalman Filtering</a>, <a href="../../public/cds270/lecture02.pdf">Notes</a></td>
</tr>

<tr>
<td class="right">3</td>
<td class="left">Functions of Symmetric Matrices</td>
<td class="left"><a href="../../public/cds270/lecture03.pdf">Notes</a></td>
</tr>

<tr>
<td class="right">4</td>
<td class="left">Estimation over Lossy Networks</td>
<td class="left"><a href="../../public/cds270/lecture04.pdf">Notes</a></td>
</tr>

<tr>
<td class="right">5</td>
<td class="left">Control Over Lossy Networks, Witsenhausen's counterexample</td>
<td class="left"><a href="http://www.isr.umd.edu/~mcrotk/courses/references/counterexample.pdf%20">Witsenhausen's paper</a>, <a href="http://users.ece.cmu.edu/~brunos/Publications/IEEE_proceedings_2006.pdf">Control over Lossy Networks</a>, <a href="../../public/cds270/lecture05.pdf">Notes</a></td>
</tr>

<tr>
<td class="right">6</td>
<td class="left">Sensor Selection</td>
<td class="left"><a href="http://web.stanford.edu/~boyd/papers/sensor_selection.html">Convex opt</a>, <a href="http://las.ethz.ch/files/krause12survey.pdf">Submodularity</a>, <a href="../../public/cds270/lecture06.pdf">Notes</a></td>
</tr>

<tr>
<td class="right">7</td>
<td class="left">Event-based Estimation</td>
<td class="left"><a href="http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6760850">Event-triggered Estimation</a>, <a href="http://www.seas.ucla.edu/~tabuada/Papers/EventTriggered.pdf">Event-based Control</a>, <a href="../../public/cds270/lecture07.pdf">Notes</a></td>
</tr>

<tr>
<td class="right">8</td>
<td class="left">Average Consensus</td>
<td class="left"><a href="http://ieeexplore.ieee.org/xpl/login.jsp?tp=&arnumber=4524051">Good Topology</a>, <a href="../../public/cds270/lecture08.pdf">Notes</a></td>
</tr>

<tr>
<td class="right">9</td>
<td class="left">Variants of Average Consensus</td>
<td class="left"><a href="http://users.ece.cmu.edu/~soummyak/Asilomar_07_sub.pdf%20">Consensus with Switching Topology and Channel Noise</a>, <a href="https://ece.uwaterloo.ca/~ssundara/papers/acc07_distcon.pdf">Finite Time Consensus</a>, <a href="http://arxiv.org/pdf/math/0701724.pdf">Finite Time Consensus(continuous time)</a>, <a href="../../public/cds270/lecture09.pdf">Notes</a></td>
</tr>

<tr>
<td class="right">10</td>
<td class="left">Gossip Algorithm</td>
<td class="left"><a href="http://web.stanford.edu/~boyd/papers/gossip.html">Gossip paper</a>, <a href="http://www.jstor.org/discover/10.2307/2237962?uid=2&uid=4&sid=21104430055591">Products of Random Matrices</a>, <a href="../../public/cds270/lecture10.pdf">Notes</a></td>
</tr>

<tr>
<td class="right">11</td>
<td class="left">Large Deviation</td>
<td class="left"><a href="http://www.ifp.illinois.edu/~srikant/ECE567/Fall09/cramer-many-sources.pdf">Cramer's Theorem</a></td>
</tr>

<tr>
<td class="right">12</td>
<td class="left">Distributed Hypothesis Testing</td>
<td class="left"><a href="http://ieeexplore.ieee.org/xpl/login.jsp?tp=&arnumber=5771607">Reference</a>, <a href="../../public/cds270/lecture12.pdf">Notes</a></td>
</tr>

<tr>
<td class="right">13</td>
<td class="left">Distributed Estimation</td>
<td class="left"><a href="http://www.cds.caltech.edu/~murray/wiki/index.php/CDS_270-4:_Distributed_Kalman_Filtering">References</a>, <a href="http://paduaresearch.cab.unipd.it/90/1/DistributedKalmanFiltering.pdf">Constant Gain Strategy</a>, <a href="../../public/cds270/lecture13.pdf">Notes</a></td>
</tr>

<tr>
<td class="right">14</td>
<td class="left">Nonnegative Matrices and Distributed Control</td>
<td class="left"><a href="http://www.math.harvard.edu/library/sternberg/slides/1180912pf.pdf">Perron-Frobenius theorem</a>, <a href="http://arxiv.org/pdf/1203.0047v3.pdf">Control of Positive System</a>, <a href="../../public/cds270/lecture14.pdf">Notes</a></td>
</tr>

<tr>
<td class="right">15</td>
<td class="left">Generic Properties of Linear Structured Systems</td>
<td class="left"><a href="http://www.sciencedirect.com/science/article/pii/S0005109803001043">A Survey Paper</a>, <a href="../../public/cds270/lecture15.pdf">Notes</a></td>
</tr>

<tr>
<td class="right">16</td>
<td class="left">Secure Control: Intrusion Detection and Identification</td>
<td class="left"><a href="http://www.fabiopas.it/papers/FP-AB-FB-10a.pdf">Secure Consensus</a>, <a href="http://ieeexplore.ieee.org/xpl/login.jsp?tp=&arnumber=16422">Fault Detection and Identification</a>, <a href="../../public/cds270/lecture16.pdf">Notes</a></td>
</tr>
</tbody>
</table>
</div>
</div>
